//
//  Theme.swift
//  Memorize
//
//  Created by 买祥 on 2024/5/22.
//

import SwiftUI

let fruits = ["🍎", "🍌", "🍇", "🍈", "🍓", "🍑", "🍉", "🥝", "🍐", "🍏", "🍊", "🍋", "🫐", "🥭", "🍒", "🥥", "🍋‍🟩", "🍍"]
let foods = ["🥐", "🥯", "🍞", "🥖", "🥨", "🥞", "🧇", "🍗", "🌭", "🍔", "🍟", "🍕", "🥪", "🥙", "🧆", "🌮", "🌯", "🫔", "🥗", "🥘", "🍣", "🍜", "🍱", "🥮", "🍩", "🍡"]
let animals = ["🐶", "🐱", "🐭", "🐹", "🐰", "🦊", "🐻", "🐼", "🐻‍❄️", "🐨", "🐯", "🦁", "🐮", "🐷", "🐸", "🐵"]

let products = ["⌚️", "📱", "💻", "🖥️", "🎧", "🖨️", "📷", "🎥", "🎙️", "📟", "☎️", "🕹️", "📼", "📠", "📻", "💽", "📺"]

let sports = ["⚽️", "🏀", "🏈", "⚾️", "🎾", "🏐", "🏉", "🥏", "🎱", "🪀", "🏓"]

let cars = ["🚗", "🚕", "🚙", "🚌", "🚎", "🏎️", "🚓", "🚑", "🚒", "🚐", "🛻", "🚚", "🚛", "🚜"]

let landmarks = ["🗿", "🗽", "🗼", "🏯", "🗻", "🕋", "⛩️", "🕌", "🕍", "⛪️", "🏛️", "🛕", "🏰"]

struct Theme {
    let name: String
    let emoji: [String]
    let numberOfPairs: Int
    let color: Color
}


struct ThemeManager {
    var theme: Theme
}
